Repository: pingfangx/TranslatorX-other
Catalog: miscellaneous/omegat/project_save.tmx
Source language: en_us
Languages: zh_cn

source: In order to prevent this form of attack, users should carefully examine the certificate presented by the server to determine if it meets their expectations.
zh_cn: 为了防止这种形式的攻击，用户应仔细检查服务器提供的证书，以确定它是否符合他们的期望。

source: In order to remain persistent, all messages on a connection need to have a self-defined message length (i.e., one not defined by closure of the connection), as described in Section 3.3.
zh_cn: 为了保持持久性，连接上的所有消息都需要具有自定义的消息长度(即，未通过关闭连接定义的消息长度)，如 3.3 节所述。

source: In order to remain persistent, all messages on the connection MUST have a self-defined message length (i.e., one not defined by closure of the connection), as described in section 4.4.
zh_cn: 为了保持持久性，连接上的所有消息必须具有自定义的消息长度(即，未通过关闭连接定义的消息长度)，如 4.4 节所述。

source: In order to use PSKs, clients MUST also send a "psk_key_exchange_modes" extension.
zh_cn: 为了使用 PSK，客户端还必须发送“psk_key_exchange_modes”扩展。

source: In other cases, the data within the host component identifies a registered name that has nothing to do with an Internet host.
zh_cn: 在其他情况下，主机组件中的数据标识与互联网主机无关的注册名称。

source: In other documents and other contexts, what we are calling an “observer” is sometimes called a “subscriber,” “watcher,” or “reactor.” This model in general is often referred to as the “reactor pattern”.
zh_cn: 在其他文件和其他场景下，我们所谓的“观察者 (observer)”有时被称为“订阅者 (subscriber)”，“观察者 (watcher)”或“反应者 (reactor)”。这种模型通常被称为 “反应者模式 (reactor pattern)”。

source: In other scenarios, the result(s) of the first source/dataflow is irrelevant and one would like to continue with a quasi independent another source.
zh_cn: 在其他场景中，第一个源/数据流的结果是无关紧要的，并且人们希望继续使用准独立的另一个源。

source: In other words, a record with an Alert type MUST contain exactly one message.
zh_cn: 换句话说，具有 Alert 类型的记录必须只包含一条消息。

source: In other words, if the server is reading the protocol stream at the beginning of a message and receives a CRLF first, it should ignore the CRLF.
zh_cn: 换句话说，如果服务器在消息开头读取协议流并首先接收 CRLF，则应忽略 CRLF。

source: In other words, the URI generic syntax is a superset of the syntax of all URI schemes.
zh_cn: 换句话说，URI 通用语法是所有 URI 方案的语法的超集。

source: In other words, the origin server is willing to accept the possibility that the trailer fields might be silently discarded along the path to the client.
zh_cn: 换句话说，源服务器愿意接受 trailer 字段可能沿着到客户端的路径被静默丢弃的可能性。

source: In other words, they are not allowed to blindly forward the first line of an HTTP message without ensuring that the protocol version in that message matches a version to which that intermediary is conformant for both the receiving and sending of messages.
zh_cn: 换句话说，不允许它们盲目地转发 HTTP 消息的第一行而不确保该消息中的协议版本与该中介符合接收和发送消息的版本匹配。

source: In other words:
zh_cn: 换句话说：

source: In particular, MD5 [SLOTH], SHA-224, and DSA MUST NOT be used.
zh_cn: 特别是，不得使用 MD5 [SLOTH]，SHA-224 和 DSA。

source: In particular, SYNs addressed to a non-existent connection are rejected by this means.
zh_cn: 特别是，通过这种方式拒绝寻址到不存在的连接的 SYN。

source: In particular, it MUST NOT negotiate TLS 1.3.
zh_cn: 特别是，它不能协商 TLS 1.3。

source: In particular, servers SHOULD be prepared to receive an incomplete close from the client, since the client can often determine when the end of server data is.
zh_cn: 特别是，服务器应该准备好从客户端接收不完整的关闭，因为客户端通常可以确定服务器数据的结束时间。

source: In particular, the Host and Connection header fields ought to be implemented by all HTTP/1.x implementations whether or not they advertise conformance with HTTP/1.1.
zh_cn: 特别是，Host 和 Connection 首部字段应该由所有 HTTP/1.x 实现实现，无论它们是否宣传与 HTTP/1.1 的一致性。

source: In particular, the convention has been established that the GET and HEAD methods SHOULD NOT have the significance of taking an action other than retrieval.
zh_cn: 特别是，已经建立了这样的惯例：GET 和 HEAD 方法不应该具有采取除检索之外的动作的意义。

source: In particular, this includes any alerts sent by the server in response to client Certificate and CertificateVerify messages.
zh_cn: 特别是，这包括服务器响应客户端 Certificate 和 CertificateVerify 消息而发送的任何警报。

source: In particular, use of external profiling information to determine the exact mapping is not permitted.
zh_cn: 特别是，不允许使用外部分析信息来确定精确的映射。

source: In particular:
zh_cn: 特别是：

source: In practice, most HTTP header field values use only a subset of the US-ASCII charset [USASCII].
zh_cn: 实际上，大多数 HTTP 首部字段值仅使用 US-ASCII 字符集 [USASCII] 的子集。

source: In practice, with modern machines this interval is likely to be fairly short.
zh_cn: 在实践中，对于现代机器，这个间隔可能相当短。

source: In previous versions of TLS, the verify_data was always 12 octets long.
zh_cn: 在以前版本的 TLS 中，verify_data 总是 12 个八位字节。

source: In prior versions of TLS, the CertificateRequest message carried a list of signature algorithms and certificate authorities which the server would accept.
zh_cn: 在早期版本的 TLS 中，CertificateRequest 消息携带了服务器可接受的签名算法和证书颁发机构的列表。

source: In public key encryption, a public key algorithm is used to encrypt data in such a way that it can be decrypted only with the matching private key.
zh_cn: 在公钥加密中，公钥算法用于加密数据，使得只能使用匹配的私钥对数据进行解密。

source: In response to sending data the TCP will receive acknowledgments.
zh_cn: 为响应发送数据，TCP 将收到确认。

source: In response, the client should send a ClientHello message when convenient.
zh_cn: 作为响应，客户端应该在方便时发送 ClientHello 消息。

source: In response, the server will send its own ChangeCipherSpec message, transfer the pending to the current Cipher Spec, and send its Finished message under the new Cipher Spec.
zh_cn: 作为响应，服务器将发送其自己的 ChangeCipherSpec 消息，将挂起传输到当前的加密规范，并在新的加密规范下发送其 Finished 消息。

source: In return, the `observeOn` calls `Subscription.request(n)` with a value to tell the `range` it is allowed to produce (i.e., `onNext` it) that many **additional** elements.
zh_cn: 作为回应，`observeOn` 调用 `Subscription.request(n)`，其值为告诉 `range`，它允许生产(即 `onNext`)多少个**额外的**元素。

source: In some ReactiveX implementations, there is a specialized observer interface, Subscriber, that implements an unsubscribe method.
zh_cn: 在一些 ReactiveX 实现中，有一个特殊的观察者​器接口 Subscriber，它实现了 unsubscribe 方法。

source: In some cases, a payload might contain only the associated representation's header fields (e.g., responses to HEAD) or only some part(s) of the representation data (e.g., the 206 (Partial Content) status code).
zh_cn: 在一些情况下，有效载荷可以仅包含关联表示的首部字段（例如，对 HEAD 的响应）或仅包含表示数据的一些部分（例如，206（部分内容）状态代码）。

source: In some cases, a single intermediary might act as an origin server, proxy, gateway, or tunnel, switching behavior based on the nature of each request.
zh_cn: 在某些情况下，单个中介可以充当源服务器，代理，网关或隧道，根据每个请求的性质切换行为。

source: In some cases, communication options are hard-coded in a client's configuration.
zh_cn: 在某些情况下，通信选项在客户端配置中是硬编码的。

source: In some cases, it might either be inappropriate or highly inefficient for the client to send the body if the server will reject the message without looking at the body.
zh_cn: 在某些情况下，如果服务器在不查看正文的情况下拒绝邮件，则客户端发送正文可能不合适或效率极低。

source: In some cases, the URI is specified as an IP address rather than a hostname.
zh_cn: 在某些情况下，URI 被指定为 IP 地址而不是主机名。

source: In some contexts such names would indicate methods by means of which event handlers are registered.
zh_cn: 在某些场景中下，此类名称将指示通过哪个事件处理程序 registered (注册) 的方法。

source: In some implementations of ReactiveX, there is also something called a “Connectable” Observable.
zh_cn: 在 ReactiveX 的一些实现中，还存在称为“Connectable” 的 Observable。

source: In special cases, it may be appropriate for the client to simply ignore the server's identity, but it must be understood that this leaves the connection open to active attack.
zh_cn: 在特殊情况下，客户端可以简单地忽略服务器的身份，但必须理解的是，这会使连接受到主动攻击。

source: In stream cipher encryption, the plaintext is exclusive-ORed with an identical amount of output generated from a cryptographically secure keyed pseudorandom number generator.
zh_cn: 在流密码加密中，明文与从密码安全密钥伪随机数生成器生成的相同数量的输出进行异或运算。

source: In such cases, some algorithm is used by the origin server to select one of those representations as most applicable to a given request, usually based on content negotiation.
zh_cn: 在这种情况下，原始服务器使用某种算法来选择那些表示最适用于给定请求的表示之一，通常基于内容协商。

source: In such cases, they are represented as unsigned integers (i.e., leading zero octets are not required even if the most significant bit is set).
zh_cn: 在这种情况下，它们被表示为无符号整数(即，即使设置了最高有效位，也不需要前导零八位字节)。

source: In such cases, user agents SHOULD present to the user the entity returned with the response, since that entity is likely to include human- readable information which will explain the unusual status.
zh_cn: 在这种情况下，用户代理应该向用户呈现随响应返回的实体，因为该实体可能包括将解释异常状态的人类可读信息。

source: In such situations, there are usually two options to fix the transformation: 1) convert to the desired type or 2) find and use an overload of the specific operator supporting the different type.
zh_cn: 在这种情况下，通常有两个选项来修复转换：1)转换为所需类型或 2)查找并使用支持不同类型的特定运算符的重载。

source: In summary, a language tag is composed of 1 or more parts: A primary language tag and a possibly empty series of subtags:
zh_cn: 总之，语言标记由一个或多个部分组成：主要语言标记和可能为空的子标记系列：

source: In that case, the client MUST send the same ClientHello without modification, except as follows:
zh_cn: 在这种情况下，客户端必须发送相同的 ClientHello 而不进行修改，除非是以下情况：

source: In the ClientHello message, the "extension_data" field of this extension contains a "KeyShareClientHello" value:
zh_cn: 在 ClientHello 消息中，此扩展的“extension_data”字段包含“KeyShareClientHello”值：

source: In the Key Exchange phase, the client sends the ClientHello (Section 4.1.2) message, which contains a random nonce (ClientHello.random); its offered protocol versions; a list of symmetric cipher/HKDF hash pairs; either a set of Diffie-Hellman key shares (in the "key_share" (Section 4.2.8) extension), a set of pre-shared key labels (in the "pre_shared_key" (Section 4.2.11) extension), or both; and potentially additional extensions.
zh_cn: 在密钥交换阶段，客户端发送 ClientHello(第 4.1.2 节)消息，其中包含随机 nonce(ClientHello.random)；它提供的协议版本；对称密码/HKDF 哈希对列表；一组 Diffie-Hellman 密钥共享(在“key_share”(第 4.2.8 节)扩展中)，一组预共享密钥标签(在“pre_shared_key”(第 4.2.11 节)扩展中)或两者；以及可能的附加扩展。

source: In the Reactive-Streams specification, the `Subject`-like behavior, namely being a consumer and supplier of events at the same time, is done by the `org.reactivestreams.Processor` interface.
zh_cn: 在 Reactive-Streams 规范中，类似 `Subject` 的行为，即同时成为事件的消费者和供应者，由 `org.reactivestreams.Processor` 接口完成。

source: In the SYN-SENT state (a RST received in response to an initial SYN), the RST is acceptable if the ACK field acknowledges the SYN.
zh_cn: 在 SYN-SENT 状态(响应初始 SYN 而接收的 RST)中，如果 ACK 字段确认 SYN，则 RST 是可接受的。

source: In the absence of an application profile standard specifying otherwise, a TLS-compliant application MUST implement the cipher suite TLS_RSA_WITH_AES_128_CBC_SHA (see Appendix A.5 for the definition).
zh_cn: 如果没有在应用程序简档标准中指定，则 TLS 兼容应用程序必须实现加密套件 TLS_RSA_WITH_AES_128_CBC_SHA(见附录 A.5 的定义)。

source: In the absence of knowledge about the sequence numbers used on a particular connection, the TCP specification recommends that the source delay for MSL seconds before emitting segments on the connection, to allow time for segments from the earlier connection incarnation to drain from the system.
zh_cn: 在没有关于特定连接上使用的序列号的知识的情况下，TCP 规范建议在连接上发送报文段之前 MSL 秒的源延迟，以允许来自早期连接化身的报文段的时间从系统中消耗。

source: In the asynchronous model the flow goes more like this:
zh_cn: 在异步模型中，流程更像是：

source: In the case of URI, the object is a sequence of characters with a restricted syntax.
zh_cn: 在 URI 的情况下，标识符是具有受限语法的字符序列。

source: In the classical Rx.NET and early RxJava, these buffers were unbounded, meaning that they would likely hold nearly all 1 million elements from the example.
zh_cn: 在经典的 Rx.NET 和早期的 RxJava 中，这些缓冲区是无界的，这意味着在该示例中，它们可能会持有几乎所有的 100 万个元素。

source: In the current version of TLS, it depends on the cipher suite.
zh_cn: 在 TLS 的当前版本，它依赖于加密套件。

source: In the event that a client requests additional functionality using extensions and this functionality is not supplied by the server, the client MAY abort the handshake.
zh_cn: 如果客户端使用扩展请求其他功能，并且服务器不提供此功能，则客户端可以中止握手。

source: In the event that a client requests additional functionality using extensions, and this functionality is not supplied by the server, the client MAY abort the handshake.
zh_cn: 如果客户端使用扩展请求其他功能，并且服务器不提供此功能，则客户端可以中止握手。

source: In the example we call `onComplete()` if the read byte is negative, indicating and end of file, and call `onError` in case the read throws an `IOException`.
zh_cn: 在示例中，如果读取字节为负数，指示和文件结束，则调用 `onComplete()`，并在读取抛出 `IOException` 时调用 `onError`。

source: In the few cases where this specification requires reporting of errors to the user, it is acceptable for such reporting to only be observable in an error console or log file.
zh_cn: 在此规范要求向用户报告错误的少数情况下，只有在错误控制台或日志文件中才能观察到此类报告。

source: In the first example, a fully qualified reference to the second element of the enumeration would be Color.blue.
zh_cn: 在第一个示例中，枚举的第二个元素的完全限定引用是 Color.blue。

source: In the following example
zh_cn: 在以下示例中

source: In the following example, "mandatory" is a vector that must contain between 300 and 400 bytes of type opaque.
zh_cn: 在以下示例中，“mandatory”是一个 vector，必须包含 300 到 400 个字节的 opaque 类型。

source: In the following example, Datum is defined to be three consecutive bytes that the protocol does not interpret, while Data is three consecutive Datum, consuming a total of nine bytes.
zh_cn: 在下面的示例中，Datum 被定义为协议不解释的三个连续字节，而 Data 是三个连续的 Datum，总共消耗 9 个字节。

source: In the following example, Taste will consume two bytes in the data stream but can only assume the values 1, 2, or 4 in the current version of the protocol.
zh_cn: 在以下示例中，Taste 将在数据流中消耗两个字节，但在当前版本的协议中只能采用值 1,2 或 4。（译注：32000 需 2 个字节表示）

source: In the following example, Taste will consume two bytes in the data stream but can only assume the values 1, 2, or 4.
zh_cn: 在以下示例中，Taste 将消耗数据流中的两个字节，但只能采用值 1,2 或 4。（译注：32000 需 2 个字节表示）

source: In the following example, mandatory is a vector that must contain between 300 and 400 bytes of type opaque.
zh_cn: 在以下示例中，mandatory 是一个 vector，必须包含 300 到 400 个字节的 opaque 类型。

source: In the interest of robustness, a server that is expecting to receive and parse a request-line SHOULD ignore at least one empty line (CRLF) received prior to the request-line.
zh_cn: 为了健状性，期望接收和解析请求行的服务器应该忽略在请求行之前接收的至少一个空行(CRLF)。

source: In the interest of robustness, servers SHOULD ignore any empty line(s) received where a Request-Line is expected.
zh_cn: 为了鲁棒性，服务器应该忽略在预期请求行的地方收到的任何空行。

source: In the latter case, it receives the error message "connection not open" from the local (A's) TCP.
zh_cn: 在后一种情况下，它从本地(A)的 TCP 接收错误消息“connection not open”。

source: In the long form, the length octets shall consist of an initial octet and one or more subsequent octets.
zh_cn: 在长形式中，长度八位字节应由初始八位字节和一个或多个后续八位字节组成。

source: In the original Rx.NET, the operator that emits a single item and then completes is called `Return(T)`.
zh_cn: 在原始的 Rx.NET 中，发出单个项然后完成的运算符称为 `Return(T)`。

source: In the original SSL and TLS specs, "DSS" was used universally.
zh_cn: 在最初的 SSL 和 TLS 规范中，普遍使用“DSS”。

source: In the paragraphs below, an explanation for this specification is given.
zh_cn: 在下面的段落中，给出了对该说明书的解释。

source: In the past, differences in the handling of such whitespace have led to security vulnerabilities in request routing and response handling.
zh_cn: 过去，处理此类空白的差异导致请求路由和响应处理中的安全漏洞。

source: In the short form, the length octets shall consist of a single octet in which bit 8 is zero and bits 7 to 1 encode the number of octets in the contents octets (which may be zero), as an unsigned binary integer with bit 7 as the most significant bit.
zh_cn: 在短格式中，长度八位字节应由单个八位字节组成，其中位 8 为零，位 7 到 1 编码内容八位字节中的八位字节数(可以为零)，作为无符号二进制整数，位 7 为最高位。

source: In the simplest case, this may be accomplished via a single connection (v) between the user agent (UA) and the origin server (O).
zh_cn: 在最简单的情况下，这可以通过用户代理(UA)和源服务器(O)之间的单个连接(v)来完成。

source: In the simplest case, this might be accomplished via a single bidirectional connection (===) between the user agent (UA) and the origin server (O).
zh_cn: 在最简单的情况下，这可以通过用户代理(UA)和源服务器(O)之间的单个双向连接(===)来完成。

source: In theory, a client could receive requests and a server could receive responses, distinguishing them by their different start-line formats, but, in practice, servers are implemented to only expect a request (a response is interpreted as an unknown or invalid request method) and clients are implemented to only expect a response.
zh_cn: 理论上，客户端可以接收请求，服务器可以接收响应，通过不同的起始行格式区分它们，但实际上，服务器实现为仅期望请求(响应被解释为未知或无效的请求方法)并且客户端实现为只期望响应。

source: In this case the absolute path of the URI MUST be transmitted (see section 3.2.1, abs_path) as the Request-URI, and the network location of the URI (authority) MUST be transmitted in a Host header field.
zh_cn: 在这种情况下，URI 的绝对路径必须作为 Request-URI 传输(参见第 3.2.1 节，abs_path)，并且 URI(authority)的网络位置必须在 Host 首部字段中传输。

source: In this case, a FIN segment can be constructed and placed on the outgoing segment queue.
zh_cn: 在这种情况下，可以构造 FIN 报文段并将其放置在传出报文段队列上。

source: In this case, a PUT request on a general URI might result in several other URIs being defined by the origin server.
zh_cn: 在这种情况下，对一般 URI 的 PUT 请求可能会导致原始服务器定义其他几个 URI。

source: In this case, either 200 (OK) or 204 (No Content) is the appropriate response status, depending on whether or not the response includes an entity that describes the result.
zh_cn: 在这种情况下，200(OK)或 204(No Content)是适当的响应状态，具体取决于响应是否包括描述结果的实体。

source: In this case, one can use one of the following operators.
zh_cn: 在这种情况下，可以使用以下操作符之一。

source: In this case, other connections corresponding to the session may continue, but the session identifier MUST be invalidated, preventing the failed session from being used to establish new connections.
zh_cn: 在这种情况下，对应于会话的其他连接可以继续，但是会话标识符必须无效，防止失败的会话被用于建立新连接。

source: In this case, the client is offering the capability to understand the extension type, and the server is taking the client up on its offer.
zh_cn: 在这种情况下，客户端提供了理解扩展类型的能力，而服务器正在接受客户机的提议。

source: In this case, the client key exchange message will be sent, but it MUST be empty.
zh_cn: 在这种情况下，客户端密钥交换消息将被发送，但它必须是空的。

source: In this case, the data arriving at TCP A from TCP B (line 2) is unacceptable because no such connection exists, so TCP A sends a RST.
zh_cn: 在这种情况下，从 TCP B(第 2 行)到达 TCP A 的数据是不可接受的，因为不存在这样的连接，因此 TCP A 发送 RST。

source: In this case, the delegation works the same way.
zh_cn: 在这种情况下，委托以相同的方式工作。

source: In this case, the iPAddress subjectAltName must be present in the certificate and must exactly match the IP in the URI.
zh_cn: 在这种情况下，iPAddress subjectAltName 必须存在于证书中，并且必须与 URI 中的 IP 完全匹配。

source: In this case, the implicit part SHOULD be derived from key_block as client_write_iv and server_write_iv (as described in Section 6.3), and the explicit part is included in GenericAEAEDCipher.nonce_explicit.
zh_cn: 在这种情况下，隐式部分应该从 key_block 派生为 client_write_iv 和 server_write_iv(如 6.3 节所述)，并且显式部分包含在 GenericAEAEDCipher.nonce_explicit 中。

source: In this diagram, the following formatting conventions apply:
zh_cn: 在此图表中，应用以下格式约定：

source: In this example, the `observeOn` goes with a very low buffer size yet there is no `MissingBackpressureException` as `onBackpressureBuffer` soaks up all the 1 million values and hands over small batches of it to `observeOn`.
zh_cn: 在这个例子中，`observeOn` 的缓冲区大小非常低，但是不会产生 `MissingBackpressureException`，因为 `onBackpressureBuffer` 吸收了所有 100 万个值并将其小批量交给 `observeOn`。

source: In this example, the main thread will produce 1 million items to an end consumer which is processing it on a background thread.
zh_cn: 在此示例中，主线程将向最终消费者生产 100 万个项目，该消费者在后台线程上处理项目。

source: In this mode, the client and server MUST supply "key_share" values as described in Section 4.2.8.
zh_cn: 在此模式下，客户端和服务器必须提供“key_share”值，如第 4.2.8 节所述。

source: In this mode, the server MUST NOT supply a "key_share" value.
zh_cn: 在此模式下，服务器不得提供“key_share”值。

source: In this section, both sender and recipient refer to either the client or the server, depending on who sends and who receives the entity.
zh_cn: 在本节中，和收件人都指客户端或服务器，具体取决于谁发送以及谁接收实体。

source: In this section, we define one PRF, based on HMAC.
zh_cn: 在本节中，我们定义了一个基于 HMAC 的 PRF。

source: In this setup, the `current` starts out with `0` and next time the lambda is invoked, the parameter `current` now holds `1`.
zh_cn: 在这个设置中，`current` 以 `0` 开始，下次调用 lambda 时，参数 `current` 现在保持 `1`。

source: In this synchronous case, a `NullPointerException` will be thrown immediately while still executing `onStart`.
zh_cn: 在这种同步的情况下，在执行 `onStart` 时会立即抛出 `NullPointerException`。

source: In this version of TLS 1.3, the two input secrets are:
zh_cn: 在这个版本的 TLS 1.3 中，两个输入机密是：

source: In this way, HTTP allows basic hypermedia access to resources available from diverse applications.
zh_cn: 通过这种方式，HTTP 允许基本的超媒体访问来自不同应用程序的资源。

source: Inbound and outbound refer to the request and response paths for messages: "inbound" means "traveling toward the origin server", and "outbound" means "traveling toward the user agent"
zh_cn: 入站和出站是指消息的请求和响应路径：“入站”表示“向原始服务器行进”，“出站”表示“向用户代理行进”

source: Incorrect DHE Share
zh_cn: DHE 共享不正确

source: Indeed, a client that requests session resumption does not in general know whether the server will accept this request, and therefore it SHOULD send the same extensions as it would send if it were not attempting resumption.
zh_cn: 实际上，请求会话恢复的客户端通常不知道服务器是否会接受此请求，因此它应该发送与它未尝试恢复时发送的相同的扩展。

source: Index
zh_cn: 索引

source: Indirect referencing also provides additional flexibility and extensibility to systems that use URIs, as new media types are easier to define and deploy than new schemes of identification.
zh_cn: 间接引用还为使用 URI 的系统提供了额外的灵活性和可扩展性，因为新媒体类​​型比新的识别方案更容易定义和部署。

source: Individual media types may define their own restrictions on or structures within the fragment identifier syntax for specifying different types of subsets, views, or external references that are identifiable as secondary resources by that media type.
zh_cn: 各个媒体类型可以在片段标识符语法中定义它们自己的限制或结构，用于指定可由该媒体类型识别为辅助资源的不同类型的子集，视图或外部引用。

source: Individual schemes are not specified by this document.
zh_cn: 此文档未指定单个方案。

source: Information about the current status of this document, any errata, and how to provide feedback on it may be obtained at http://www.rfc-editor.org/info/rfc7230.
zh_cn: 有关本文档的当前状态，任何勘误以及如何提供反馈的信息，请访问 http://www.rfc-editor.org/info/rfc7230。

source: Information about the current status of this document, any errata, and how to provide feedback on it may be obtained at http://www.rfc-editor.org/info/rfc7231.
zh_cn: 有关本文档当前状态，任何勘误以及如何提供反馈的信息，请访问 http://www.rfc-editor.org/info/rfc7231。

source: Information about the current status of this document, any errata, and how to provide feedback on it may be obtained at https://www.rfc-editor.org/info/rfc8446.
zh_cn: 有关本文档的当前状态，任何勘误以及如何提供反馈的信息，请访问 https://www.rfc-editor.org/info/rfc8446。

source: Informative References
zh_cn: 资料性参考文献

source: Initial Handshake:
zh_cn: 初次握手：

source: Initial Sequence Number Selection
zh_cn: 初始序列号选择

source: Initialize a variable R to the estimated round-trip time to the server (e.g., based on the time it took to establish the connection), or to a constant value of 5 seconds if the round- trip time is not available.
zh_cn: 将变量 R 初始化为到服务器的估计往返时间(例如，基于建立连接所花费的时间)，或者如果往返时间不可用则将变量 R 初始化为 5 秒的恒定值。

source: Initially, the registry contains the following tokens:
zh_cn: 最初，注册表包含以下标记：

source: Initially, the registry contains the following tokens: "chunked" (section 3.6.1), "identity" (section 3.6.2), "gzip" (section 3.5), "compress" (section 3.5), and "deflate" (section 3.5).
zh_cn: 最初，注册表包含以下标记：“chunked”(第 3.6.1 节)，“identity”(第 3.6.2 节)，“gzip”(第 3.5 节)，“compress”(第 3.5 节)和“deflate”(第 3.5 节)。

source: Initiate a new connection to the server
zh_cn: 启动与服务器的新连接

source: Instances of URIs from any given scheme may have the characteristics of names or locators or both, often depending on the persistence and care in the assignment of identifiers by the naming authority, rather than on any quality of the scheme.
zh_cn: 来自任何给定方案的 URI 的实例可以具有名称或定位符或两者的特征，通常取决于命名机构对标识符的分配的持久性和关注，而不是该方案的任何质量。
